Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# ConvertEncoding_Invalid_Error
source: Stop at the first one with an error
ar: التوقف عند أول بايت مع خطأ
cs: Zastavit u prvního s chybou
de: Beim ersten mit einem Fehler anhalten
el: Διακοπή στο πρώτο με σφάλμα
es: Detenerse en el primero con un error
fa: توقف در نخستین مورد با خطا
fr: S'arrêter au premier avec une erreur
hu: Leállás hibával az elsőnél
id: Berhenti di yang pertama dengan kesalahan
it: Interrompi al primo con un errore
ja: 最初の箇所でエラーにして中止する
ko: 첫 번째 항목에서 오류로 중지
pl: Zatrzymaj na pierwszym z błędem
pt: Parar no primeiro com um erro
ro: Oprire la primul, cu eroare
th: หยุดที่ตำแหน่งแรกพร้อมข้อผิดพลาด
tr: İlkinde hatayla dur
uk: Зупинитися з помилкою на першому
vi: Dừng ở vị trí đầu tiên và báo lỗi
zh_hans: 在第一个出错处停止
zh_hant: 在第一個錯誤處停止

# ConvertEncoding_Invalid_Fffd
source: Replace with U+FFFD
ar: الاستبدال بـ U+FFFD
cs: Nahradit znakem U+FFFD
de: Durch U+FFFD ersetzen
el: Αντικατάσταση με U+FFFD
es: Reemplazar por U+FFFD
fa: جایگزینی با U+FFFD
fr: Remplacer par U+FFFD
hu: Csere erre: U+FFFD
id: Ganti dengan U+FFFD
it: Sostituisci con U+FFFD
ja: U+FFFD に置き換える
ko: U+FFFD로 바꾸기
pl: Zastąp znakiem U+FFFD
pt: Substituir por U+FFFD
ro: Înlocuire cu U+FFFD
th: แทนที่ด้วย U+FFFD
tr: U+FFFD ile değiştir
uk: Замінювати на U+FFFD
vi: Thay bằng U+FFFD
zh_hans: 替换为 U+FFFD
zh_hant: 以 U+FFFD 取代

# ConvertEncoding_Invalid_Keep
source: Keep them unchanged
ar: إبقاؤها دون تغيير
cs: Ponechat beze změny
de: Unverändert lassen
el: Διατήρηση χωρίς αλλαγή
es: Dejarlos sin cambios
fa: بدون تغییر نگه‌داشتن
fr: Les conserver tels quels
hu: Változatlanul hagyás
id: Biarkan tidak berubah
it: Lasciali invariati
ja: そのまま残す
ko: 변경하지 않고 유지
pl: Pozostaw bez zmian
pt: Mantê-los inalterados
ro: Păstrare nemodificată
th: คงไว้ตามเดิม
tr: Değiştirmeden koru
uk: Залишати без змін
vi: Giữ nguyên
zh_hans: 保持不变
zh_hant: 保持不變

# ConvertEncoding_Unmappable
source: Characters the target cannot represent
ar: الأحرف التي لا يمكن للهدف تمثيلها
cs: Znaky, které cílové kódování nedokáže vyjádřit
de: Zeichen, die das Ziel nicht darstellen kann
el: Χαρακτήρες που δεν μπορεί να αναπαραστήσει ο προορισμός
es: Caracteres que el destino no puede representar
fa: نویسه‌هایی که مقصد نمی‌تواند نمایش دهد
fr: Caractères que la cible ne peut pas représenter
hu: A célkódolásban nem ábrázolható karakterek
id: Karakter yang tidak dapat direpresentasikan target
it: Caratteri che la destinazione non può rappresentare
ja: 変換先で表せない文字
ko: 대상에서 표현할 수 없는 문자
pl: Znaki, których nie można przedstawić w docelowym kodowaniu
pt: Caracteres que o destino não pode representar
ro: Caractere pe care ținta nu le poate reprezenta
th: อักขระที่การเข้ารหัสปลายทางแทนไม่ได้
tr: Hedefin gösteremediği karakterler
uk: Символи, які не можна подати в цільовому кодуванні
vi: Ký tự mà bảng mã đích không biểu diễn được
zh_hans: 目标编码无法表示的字符
zh_hant: 目標無法表示的字元

# ConvertEncoding_Unmappable_Error
source: Stop at the first one with an error
ar: التوقف عند أول حرف مع خطأ
cs: Zastavit u prvního s chybou
de: Beim ersten mit einem Fehler anhalten
el: Διακοπή στον πρώτο με σφάλμα
es: Detenerse en el primero con un error
fa: توقف در نخستین مورد با خطا
fr: S'arrêter au premier avec une erreur
hu: Leállás hibával az elsőnél
id: Berhenti di yang pertama dengan kesalahan
it: Interrompi al primo con un errore
ja: 最初の箇所でエラーにして中止する
ko: 첫 번째 항목에서 오류로 중지
pl: Zatrzymaj na pierwszym z błędem
pt: Parar no primeiro com um erro
ro: Oprire la primul, cu eroare
th: หยุดที่ตำแหน่งแรกพร้อมข้อผิดพลาด
tr: İlkinde hatayla dur
uk: Зупинитися з помилкою на першому
vi: Dừng ở vị trí đầu tiên và báo lỗi
zh_hans: 在第一个出错处停止
zh_hant: 在第一個錯誤處停止

# ConvertEncoding_Unmappable_Question
source: Replace with ?
ar: الاستبدال بـ ?
cs: Nahradit znakem ?
de: Durch ? ersetzen
el: Αντικατάσταση με ?
es: Reemplazar por ?
fa: جایگزینی با ?
fr: Remplacer par ?
hu: Csere erre: ?
id: Ganti dengan ?
it: Sostituisci con ?
ja: ? に置き換える
ko: ?로 바꾸기
pl: Zastąp znakiem ?
pt: Substituir por ?
ro: Înlocuire cu ?
th: แทนที่ด้วย ?
tr: ? ile değiştir
uk: Замінювати на ?
vi: Thay bằng ?
zh_hans: 替换为 ?
zh_hant: 以 ? 取代

# ConvertEncoding_Unmappable_Custom
source: Replace with a character
ar: الاستبدال بحرف
cs: Nahradit znakem
de: Durch ein Zeichen ersetzen
el: Αντικατάσταση με χαρακτήρα
es: Reemplazar por un carácter
fa: جایگزینی با یک نویسه
fr: Remplacer par un caractère
hu: Csere egy karakterre
id: Ganti dengan karakter
it: Sostituisci con un carattere
ja: 指定した文字に置き換える
ko: 지정한 문자로 바꾸기
pl: Zastąp znakiem
pt: Substituir por um caractere
ro: Înlocuire cu un caracter
th: แทนที่ด้วยอักขระ
tr: Bir karakterle değiştir
uk: Замінювати символом
vi: Thay bằng một ký tự
zh_hans: 替换为指定字符
zh_hant: 以指定字元取代

# ConvertEncoding_Replacement
source: Replacement
ar: البديل
cs: Náhrada
de: Ersatz
el: Αντικατάσταση
es: Reemplazo
fa: جایگزین
fr: Remplacement
hu: Helyettesítő karakter
id: Pengganti
it: Sostituto
ja: 置き換える文字
ko: 대체 문자
pl: Zamiennik
pt: Substituto
ro: Înlocuitor
th: อักขระแทนที่
tr: Yerine konacak
uk: Заміна
vi: Ký tự thay thế
zh_hans: 替换字符
zh_hant: 取代字元

# ConvertEncoding_StripBom
source: Remove the BOM at the start of the source
ar: إزالة BOM من بداية المصدر
cs: Odebrat BOM na začátku zdroje
de: BOM am Anfang der Quelle entfernen
el: Αφαίρεση του BOM στην αρχή της προέλευσης
es: Quitar la BOM al inicio del origen
fa: حذف BOM از آغاز مبدأ
fr: Supprimer le BOM au début de la source
hu: A BOM eltávolítása a forrás elejéről
id: Hapus BOM di awal sumber
it: Rimuovi il BOM all'inizio dell'origine
ja: 変換元の先頭の BOM を取り除く
ko: 원본 시작 부분의 BOM 제거
pl: Usuń BOM na początku źródła
pt: Remover o BOM no início da origem
ro: Eliminare BOM de la începutul sursei
th: ลบ BOM ที่ต้นของต้นทาง
tr: Kaynağın başındaki BOM'u kaldır
uk: Видалити BOM на початку джерела
vi: Bỏ BOM ở đầu dữ liệu nguồn
zh_hans: 删除源开头的 BOM
zh_hant: 移除來源開頭的 BOM

# ConvertEncoding_AddBom
source: Add a BOM to the result
ar: إضافة BOM إلى النتيجة
cs: Přidat BOM do výsledku
de: Dem Ergebnis eine BOM hinzufügen
el: Προσθήκη BOM στο αποτέλεσμα
es: Agregar una BOM al resultado
fa: افزودن BOM به نتیجه
fr: Ajouter un BOM au résultat
hu: BOM hozzáadása az eredményhez
id: Tambahkan BOM ke hasil
it: Aggiungi un BOM al risultato
ja: 変換先に BOM を付ける
ko: 결과에 BOM 추가
pl: Dodaj BOM do wyniku
pt: Adicionar um BOM ao resultado
ro: Adăugare BOM la rezultat
th: เพิ่ม BOM ให้ผลลัพธ์
tr: Sonuca BOM ekle
uk: Додати BOM до результату
vi: Thêm BOM vào kết quả
zh_hans: 在结果中添加 BOM
zh_hant: 在結果中加上 BOM

# ConvertEncoding_Newline
source: Line breaks
ar: فواصل الأسطر
cs: Konce řádků
de: Zeilenumbrüche
el: Αλλαγές γραμμής
es: Saltos de línea
fa: شکست خط‌ها
fr: Sauts de ligne
hu: Sortörések
id: Pemisah baris
it: Interruzioni di riga
ja: 改行の変換
ko: 줄 바꿈
pl: Podziały wierszy
pt: Quebras de linha
ro: Sfârșituri de linie
th: การขึ้นบรรทัดใหม่
tr: Satır sonları
uk: Розриви рядків
vi: Ngắt dòng
zh_hans: 换行符
zh_hant: 換行

# ConvertEncoding_Newline_Keep
source: Keep
ar: إبقاء
cs: Zachovat
de: Beibehalten
el: Διατήρηση
es: Conservar
fa: نگه‌داشتن
fr: Conserver
hu: Megtartás
id: Pertahankan
it: Mantieni
ja: そのまま
ko: 유지
pl: Zachowaj
pt: Manter
ro: Păstrare
th: คงไว้
tr: Koru
uk: Зберегти
vi: Giữ nguyên
zh_hans: 保持不变
zh_hant: 保持不變

# ConvertEncoding_Normalization
source: Unicode normalization
ar: تسوية Unicode
cs: Normalizace Unicode
de: Unicode-Normalisierung
el: Κανονικοποίηση Unicode
es: Normalización Unicode
fa: نرمال‌سازی Unicode
fr: Normalisation Unicode
hu: Unicode-normalizálás
id: Normalisasi Unicode
it: Normalizzazione Unicode
ja: Unicode の正規化
ko: Unicode 정규화
pl: Normalizacja Unicode
pt: Normalização Unicode
ro: Normalizare Unicode
th: การทำให้เป็นมาตรฐาน Unicode
tr: Unicode normalleştirme
uk: Нормалізація Unicode
vi: Chuẩn hóa Unicode
zh_hans: Unicode 规范化
zh_hant: Unicode 正規化

# ConvertEncoding_Normalization_None
source: None
ar: بلا
cs: Žádná
de: Keine
el: Καμία
es: Ninguna
fa: هیچ
fr: Aucune
hu: Nincs
id: Tidak ada
it: Nessuna
ja: しない
ko: 없음
pl: Brak
pt: Nenhuma
ro: Niciuna
th: ไม่มี
tr: Yok
uk: Немає
vi: Không
zh_hans: 无
zh_hant: 無

# ConvertEncoding_LengthExact
source: {0} bytes → {1} bytes
ar: {0} بايت ← {1} بايت
cs: Bajty: {0} → {1}
el: {0} byte → {1} byte
fa: {0} بایت ← {1} بایت
fr: {0} octets → {1} octets
hu: {0} bájt → {1} bájt
id: {0} byte → {1} byte
it: {0} byte → {1} byte
ja: {0} バイト → {1} バイト
ko: {0}바이트 → {1}바이트
pl: {0} B → {1} B
ro: {0} octeți → {1} octeți
th: {0} ไบต์ → {1} ไบต์
tr: {0} bayt → {1} bayt
uk: {0} байтів → {1} байтів
vi: {0} byte → {1} byte
zh_hans: {0} 字节 → {1} 字节
zh_hant: {0} 個位元組 → {1} 個位元組

# ConvertEncoding_LengthEstimate
source: {0} bytes → about {1} bytes
ar: {0} بايت ← نحو {1} بايت
cs: Bajty: {0} → asi {1}
de: {0} Bytes → etwa {1} Bytes
el: {0} byte → περίπου {1} byte
es: {0} bytes → unos {1} bytes
fa: {0} بایت ← حدود {1} بایت
fr: {0} octets → environ {1} octets
hu: {0} bájt → körülbelül {1} bájt
id: {0} byte → sekitar {1} byte
it: {0} byte → circa {1} byte
ja: {0} バイト → 約 {1} バイト
ko: {0}바이트 → 약 {1}바이트
pl: {0} B → około {1} B
pt: {0} bytes → cerca de {1} bytes
ro: {0} octeți → aproximativ {1} octeți
th: {0} ไบต์ → ประมาณ {1} ไบต์
tr: {0} bayt → yaklaşık {1} bayt
uk: {0} байтів → приблизно {1} байтів
vi: {0} byte → khoảng {1} byte
zh_hans: {0} 字节 → 约 {1} 字节
zh_hant: {0} 個位元組 → 大約 {1} 個位元組

# ConvertEncoding_Error_Undecodable
source: The bytes at {0} ({1}) cannot be decoded.
ar: يتعذر فك ترميز البايتات عند {0} ({1}).
cs: Bajty na {0} ({1}) nelze dekódovat.
de: Die Bytes bei {0} ({1}) können nicht decodiert werden.
el: Τα byte στο {0} ({1}) δεν μπορούν να αποκωδικοποιηθούν.
es: Los bytes en {0} ({1}) no se pueden decodificar.
fa: بایت‌های موجود در {0} ({1}) قابل رمزگشایی نیستند.
fr: Les octets à {0} ({1}) ne peuvent pas être décodés.
hu: A(z) {0} helyen lévő bájtok ({1}) nem dekódolhatók.
id: Byte di {0} ({1}) tidak dapat didekode.
it: I byte in {0} ({1}) non possono essere decodificati.
ja: オフセット {0} のバイト列 ({1}) を解釈できません。
ko: {0}의 바이트({1})를 디코딩할 수 없습니다.
pl: Nie można zdekodować bajtów w {0} ({1}).
pt: Os bytes em {0} ({1}) não podem ser decodificados.
ro: Octeții de la {0} ({1}) nu pot fi decodificați.
th: ไม่สามารถถอดรหัสไบต์ที่ {0} ({1})
tr: {0} konumundaki baytlar ({1}) çözülemiyor.
uk: Не вдається декодувати байти в позиції {0} ({1}).
vi: Không thể giải mã các byte tại {0} ({1}).
zh_hans: 无法解码位于 {0} 的字节（{1}）。
zh_hant: 無法解碼位於 {0} 的位元組（{1}）。

# ConvertEncoding_Error_Unmappable
source: The character "{1}" at {0} cannot be represented in the target encoding.
ar: لا يمكن تمثيل الحرف «{1}» عند {0} في الترميز الهدف.
cs: Znak „{1}“ na {0} nelze v cílovém kódování vyjádřit.
de: Das Zeichen „{1}“ bei {0} kann in der Zielcodierung nicht dargestellt werden.
el: Ο χαρακτήρας «{1}» στο {0} δεν μπορεί να αναπαρασταθεί στην κωδικοποίηση προορισμού.
es: El carácter “{1}” en {0} no se puede representar en la codificación de destino.
fa: نویسهٔ «{1}» در {0} در رمزگذاری مقصد قابل نمایش نیست.
fr: Le caractère « {1} » à {0} ne peut pas être représenté dans l'encodage cible.
hu: A(z) {0} helyen lévő „{1}” karakter nem ábrázolható a célkódolásban.
id: Karakter “{1}” di {0} tidak dapat direpresentasikan dalam pengodean target.
it: Il carattere “{1}” in {0} non può essere rappresentato nella codifica di destinazione.
ja: オフセット {0} の文字「{1}」は変換先の文字コードで表せません。
ko: {0}의 문자 "{1}"은(는) 대상 인코딩으로 표현할 수 없습니다.
pl: Znaku „{1}” w {0} nie można przedstawić w docelowym kodowaniu.
pt: O caractere “{1}” em {0} não pode ser representado na codificação de destino.
ro: Caracterul „{1}” de la {0} nu poate fi reprezentat în codificarea țintă.
th: อักขระ “{1}” ที่ {0} แทนด้วยการเข้ารหัสปลายทางไม่ได้
tr: {0} konumundaki "{1}" karakteri hedef kodlamada gösterilemiyor.
uk: Символ «{1}» у позиції {0} не можна подати в цільовому кодуванні.
vi: Ký tự “{1}” tại {0} không thể biểu diễn trong bảng mã đích.
zh_hans: 位于 {0} 的字符“{1}”无法用目标编码表示。
zh_hant: 位於 {0} 的字元「{1}」無法以目標編碼表示。

# ConvertEncoding_Error_FixedLength
source: The length changes, but this document cannot change its length.
ar: يتغير الطول، لكن لا يمكن تغيير طول هذا المستند.
cs: Délka se změní, ale tento dokument nemůže měnit délku.
de: Die Länge ändert sich, aber die Länge dieses Dokuments kann nicht geändert werden.
el: Το μήκος αλλάζει, αλλά αυτό το έγγραφο δεν μπορεί να αλλάξει μήκος.
es: La longitud cambia, pero la longitud de este documento no puede cambiar.
fa: طول تغییر می‌کند، اما طول این سند قابل تغییر نیست.
fr: La longueur change, mais ce document ne peut pas changer de longueur.
hu: A hossz megváltozna, de ennek a dokumentumnak a hossza nem módosítható.
id: Panjangnya berubah, tetapi dokumen ini tidak dapat mengubah panjangnya.
it: La lunghezza cambia, ma la lunghezza di questo documento non può cambiare.
ja: 長さが変わりますが、このドキュメントは長さを変えられません。
ko: 길이가 변경되지만 이 문서는 길이를 변경할 수 없습니다.
pl: Długość się zmienia, ale ten dokument nie może zmienić długości.
pt: O comprimento muda, mas este documento não pode mudar de comprimento.
ro: Lungimea se modifică, dar lungimea acestui document nu poate fi modificată.
th: ความยาวเปลี่ยนไป แต่เอกสารนี้เปลี่ยนความยาวไม่ได้
tr: Uzunluk değişiyor, ancak bu belgenin uzunluğu değiştirilemez.
uk: Довжина змінюється, але довжину цього документа змінити не можна.
vi: Độ dài thay đổi, nhưng tài liệu này không thể thay đổi độ dài.
zh_hans: 长度会改变，但此文档无法更改长度。
zh_hant: 長度會改變，但此文件無法變更長度。

# ConvertEncoding_GoToOffset
source: Go to the offset
ar: الانتقال إلى الإزاحة
cs: Přejít na posun
de: Zum Offset springen
el: Μετάβαση στη μετατόπιση
es: Ir al desplazamiento
fa: رفتن به آفست
fr: Atteindre le décalage
hu: Ugrás az eltolásra
id: Navigasi ke offset
it: Vai all'offset
ja: そのオフセットへ移動
ko: 해당 오프셋으로 이동
pl: Przejdź do przesunięcia
pt: Ir para o deslocamento
ro: Salt la deplasament
th: ไปที่ออฟเซ็ต
tr: Ofsete git
uk: Перейти до зміщення
vi: Đi tới độ lệch
zh_hans: 转到该偏移量
zh_hant: 移至該位移

# Hash_Exclusions.Header
source: Excluded ranges
ar: النطاقات المستبعدة
cs: Vyloučené rozsahy
de: Ausgeschlossene Bereiche
el: Περιοχές που εξαιρούνται
es: Rangos excluidos
fa: محدوده‌های استثناشده
fr: Plages exclues
hu: Kizárt tartományok
id: Rentang yang dikecualikan
it: Intervalli esclusi
ja: 除外範囲
ko: 제외 범위
pl: Wykluczone zakresy
pt: Intervalos excluídos
ro: Intervale excluse
th: ช่วงที่ไม่รวม
tr: Dışlanan aralıklar
uk: Виключені діапазони
vi: Phạm vi loại trừ
zh_hans: 排除的范围
zh_hant: 排除的範圍

# Hash_ExclusionStart.Header
source: Start
ar: البداية
cs: Začátek
de: Anfang
el: Αρχή
es: Inicio
fa: آغاز
fr: Début
hu: Kezdet
id: Awal
it: Inizio
ja: 開始
ko: 시작
pl: Początek
pt: Início
ro: Început
th: เริ่มต้น
tr: Başlangıç
uk: Початок
vi: Bắt đầu
zh_hans: 开始
zh_hant: 開始

# Hash_ExclusionLength.Header
source: Length
ar: الطول
cs: Délka
de: Länge
el: Μήκος
es: Longitud
fa: طول
fr: Longueur
hu: Hossz
id: Panjang
it: Lunghezza
ja: 長さ
ko: 길이
pl: Długość
pt: Comprimento
ro: Lungime
th: ความยาว
tr: Uzunluk
uk: Довжина
vi: Độ dài
zh_hans: 长度
zh_hant: 長度

source: Remove excluded range
ar: إزالة النطاق المستبعد
cs: Odebrat vyloučený rozsah
de: Ausgeschlossenen Bereich entfernen
el: Κατάργηση εξαιρούμενης περιοχής
es: Quitar rango excluido
fa: حذف محدودهٔ استثناشده
fr: Supprimer la plage exclue
hu: Kizárt tartomány eltávolítása
id: Hapus rentang yang dikecualikan
it: Rimuovi intervallo escluso
ja: 除外範囲を削除
ko: 제외 범위 제거
pl: Usuń wykluczony zakres
pt: Remover intervalo excluído
ro: Eliminare interval exclus
th: ลบช่วงที่ไม่รวม
tr: Dışlanan aralığı kaldır
uk: Видалити виключений діапазон
vi: Xóa phạm vi loại trừ
zh_hans: 删除排除的范围
zh_hant: 移除排除的範圍

# Hash_ExclusionRemove.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Remove
ar: إزالة
cs: Odebrat
de: Entfernen
el: Κατάργηση
es: Quitar
fa: حذف
fr: Supprimer
hu: Eltávolítás
id: Hapus
it: Rimuovi
ja: 削除
ko: 제거
pl: Usuń
pt: Remover
ro: Eliminare
th: ลบ
tr: Kaldır
uk: Видалити
vi: Xóa
zh_hans: 删除
zh_hant: 移除

# Hash_ExclusionAdd.Content
source: Add
ar: إضافة
cs: Přidat
de: Hinzufügen
el: Προσθήκη
es: Agregar
fa: افزودن
fr: Ajouter
hu: Hozzáadás
id: Tambah
it: Aggiungi
ja: 追加
ko: 추가
pl: Dodaj
pt: Adicionar
ro: Adăugare
th: เพิ่ม
tr: Ekle
uk: Додати
vi: Thêm
zh_hans: 添加
zh_hant: 新增

# Hash_ExclusionAddSelection.Content
source: Add selection
ar: إضافة التحديد
cs: Přidat výběr
de: Auswahl hinzufügen
el: Προσθήκη επιλογής
es: Agregar selección
fa: افزودن انتخاب
fr: Ajouter la sélection
hu: Kijelölés hozzáadása
id: Tambah pilihan
it: Aggiungi selezione
ja: 選択範囲を追加
ko: 선택 영역 추가
pl: Dodaj zaznaczenie
pt: Adicionar seleção
ro: Adăugare selecție
th: เพิ่มส่วนที่เลือก
tr: Seçimi ekle
uk: Додати виділення
vi: Thêm vùng chọn
zh_hans: 添加选定内容
zh_hant: 新增選取範圍

# Hash_ExclusionMode.Header
source: Excluded bytes
ar: البايتات المستبعدة
cs: Vyloučené bajty
de: Ausgeschlossene Bytes
el: Εξαιρούμενα byte
es: Bytes excluidos
fa: بایت‌های استثناشده
fr: Octets exclus
hu: Kizárt bájtok
id: Byte yang dikecualikan
it: Byte esclusi
ja: 除外の方法
ko: 제외할 바이트
pl: Wykluczone bajty
pt: Bytes excluídos
ro: Octeți excluși
th: ไบต์ที่ไม่รวม
tr: Dışlanan baytlar
uk: Виключені байти
vi: Byte bị loại trừ
zh_hans: 排除的字节
zh_hant: 排除的位元組

# Hash_ExclusionMode_Skip.Content
source: Skip
ar: تخطي
cs: Přeskočit
de: Überspringen
el: Παράλειψη
es: Omitir
fa: رد کردن
fr: Ignorer
hu: Kihagyás
id: Lewati
it: Salta
ja: 飛ばす
ko: 건너뛰기
pl: Pomiń
pt: Pular
ro: Omitere
th: ข้าม
tr: Atla
uk: Пропускати
vi: Bỏ qua
zh_hans: 跳过
zh_hant: 略過

# Hash_ExclusionMode_Replace.Content
source: Replace with a value
ar: الاستبدال بقيمة
cs: Nahradit hodnotou
de: Durch einen Wert ersetzen
el: Αντικατάσταση με τιμή
es: Reemplazar por un valor
fa: جایگزینی با یک مقدار
fr: Remplacer par une valeur
hu: Csere egy értékre
id: Ganti dengan nilai
it: Sostituisci con un valore
ja: 値に置き換える
ko: 값으로 바꾸기
pl: Zastąp wartością
pt: Substituir por um valor
ro: Înlocuire cu o valoare
th: แทนที่ด้วยค่า
tr: Bir değerle değiştir
uk: Замінювати значенням
vi: Thay bằng một giá trị
zh_hans: 替换为值
zh_hant: 以值取代

# Hash_ExclusionValue.Header
source: Value
ar: القيمة
cs: Hodnota
de: Wert
el: Τιμή
es: Valor
fa: مقدار
fr: Valeur
hu: Érték
id: Nilai
it: Valore
ja: 置き換える値
ko: 값
pl: Wartość
pt: Valor
ro: Valoare
th: ค่า
tr: Değer
uk: Значення
vi: Giá trị
zh_hans: 值
zh_hant: 值

# Hash_ExclusionOutside
source: Outside the target range (ignored)
ar: خارج النطاق المستهدف (يتم تجاهله)
cs: Mimo cílový rozsah (ignoruje se)
de: Außerhalb des Zielbereichs (ignoriert)
el: Εκτός του εύρους-στόχου (αγνοείται)
es: Fuera del rango de destino (se omite)
fa: خارج از محدودهٔ هدف (نادیده گرفته می‌شود)
fr: En dehors de la plage cible (ignorée)
hu: A céltartományon kívül (figyelmen kívül marad)
id: Di luar rentang target (diabaikan)
it: Fuori dall'intervallo di destinazione (ignorato)
ja: 対象範囲の外です (計算では無視します)
ko: 대상 범위 밖(무시됨)
pl: Poza zakresem docelowym (ignorowany)
pt: Fora do intervalo de destino (ignorado)
ro: În afara intervalului țintă (ignorat)
th: อยู่นอกช่วงเป้าหมาย (ละเว้น)
tr: Hedef aralığın dışında (yoksayıldı)
uk: Поза цільовим діапазоном (ігнорується)
vi: Nằm ngoài phạm vi mục tiêu (bị bỏ qua)
zh_hans: 在目标范围之外（已忽略）
zh_hant: 在目標範圍之外（已忽略）

# Hash_ExclusionInvalid
source: Enter a start and a length greater than 0.
ar: أدخل بداية وطولاً أكبر من 0.
cs: Zadejte začátek a délku větší než 0.
de: Geben Sie einen Anfang und eine Länge größer als 0 ein.
el: Εισαγάγετε αρχή και μήκος μεγαλύτερο από 0.
es: Escribe un inicio y una longitud mayor que 0.
fa: آغاز و طولی بزرگ‌تر از 0 وارد کنید.
fr: Entrez un début et une longueur supérieure à 0.
hu: Adjon meg egy kezdetet és 0-nál nagyobb hosszt.
id: Masukkan awal dan panjang yang lebih besar dari 0.
it: Immetti un inizio e una lunghezza maggiore di 0.
ja: 開始と 1 以上の長さを入力してください。
ko: 시작과 0보다 큰 길이를 입력하세요.
pl: Wprowadź początek i długość większą od 0.
pt: Insira um início e um comprimento maior que 0.
ro: Introduceți un început și o lungime mai mare decât 0.
th: ป้อนจุดเริ่มต้นและความยาวที่มากกว่า 0
tr: Bir başlangıç ve 0'dan büyük bir uzunluk girin.
uk: Введіть початок і довжину більшу за 0.
vi: Hãy nhập điểm bắt đầu và độ dài lớn hơn 0.
zh_hans: 请输入开始位置和大于 0 的长度。
zh_hant: 請輸入開始位置和大於 0 的長度。

# Hash_ReplacementInvalid
source: The replacement value must be 0x00 to 0xFF.
ar: يجب أن تكون قيمة الاستبدال من 0x00 إلى 0xFF.
cs: Náhradní hodnota musí být 0x00 až 0xFF.
de: Der Ersatzwert muss zwischen 0x00 und 0xFF liegen.
el: Η τιμή αντικατάστασης πρέπει να είναι από 0x00 έως 0xFF.
es: El valor de reemplazo debe estar entre 0x00 y 0xFF.
fa: مقدار جایگزین باید 0x00 تا 0xFF باشد.
fr: La valeur de remplacement doit être comprise entre 0x00 et 0xFF.
hu: A csereértéknek 0x00 és 0xFF között kell lennie.
id: Nilai pengganti harus 0x00 hingga 0xFF.
it: Il valore sostitutivo deve essere compreso tra 0x00 e 0xFF.
ja: 置き換える値は 0x00〜0xFF です。
ko: 대체 값은 0x00~0xFF여야 합니다.
pl: Wartość zastępcza musi wynosić od 0x00 do 0xFF.
pt: O valor de substituição deve estar entre 0x00 e 0xFF.
ro: Valoarea de înlocuire trebuie să fie între 0x00 și 0xFF.
th: ค่าแทนที่ต้องอยู่ระหว่าง 0x00 ถึง 0xFF
tr: Değiştirme değeri 0x00 ile 0xFF arasında olmalıdır.
uk: Значення заміни має бути від 0x00 до 0xFF.
vi: Giá trị thay thế phải từ 0x00 đến 0xFF.
zh_hans: 替换值必须为 0x00 到 0xFF。
zh_hant: 取代值必須介於 0x00 到 0xFF 之間。

# Hash_AddUnreadable.Content
source: Add the unreadable range to the excluded ranges
ar: إضافة النطاق غير القابل للقراءة إلى النطاقات المستبعدة
cs: Přidat nečitelný rozsah k vyloučeným rozsahům
de: Nicht lesbaren Bereich zu den ausgeschlossenen Bereichen hinzufügen
el: Προσθήκη της μη αναγνώσιμης περιοχής στις εξαιρούμενες περιοχές
es: Agregar el rango ilegible a los rangos excluidos
fa: افزودن محدودهٔ ناخوانا به محدوده‌های استثناشده
fr: Ajouter la plage illisible aux plages exclues
hu: Az olvashatatlan tartomány hozzáadása a kizárt tartományokhoz
id: Tambahkan rentang tidak terbaca ke rentang yang dikecualikan
it: Aggiungi l'intervallo illeggibile agli intervalli esclusi
ja: 読めない範囲を除外範囲に追加
ko: 읽을 수 없는 범위를 제외 범위에 추가
pl: Dodaj nieczytelny zakres do wykluczonych zakresów
pt: Adicionar o intervalo ilegível aos intervalos excluídos
ro: Adăugare interval ilizibil la intervalele excluse
th: เพิ่มช่วงที่อ่านไม่ได้ลงในช่วงที่ไม่รวม
tr: Okunamayan aralığı dışlanan aralıklara ekle
uk: Додати нечитабельний діапазон до виключених
vi: Thêm phạm vi không đọc được vào phạm vi loại trừ
zh_hans: 将不可读取的范围添加到排除的范围
zh_hant: 將無法讀取的範圍新增到排除的範圍

# Hash_CustomCrc.Content
source: Custom CRC
ar: CRC مخصص
cs: Vlastní CRC
de: Benutzerdefinierter CRC
el: Προσαρμοσμένο CRC
es: CRC personalizado
fa: CRC سفارشی
fr: CRC personnalisé
hu: Egyéni CRC
id: CRC kustom
it: CRC personalizzato
ja: カスタム CRC
ko: 사용자 지정 CRC
pl: Niestandardowy CRC
pt: CRC personalizado
ro: CRC personalizat
th: CRC ที่กำหนดเอง
tr: Özel CRC
uk: Власний CRC
vi: CRC tùy chỉnh
zh_hans: 自定义 CRC
zh_hant: 自訂 CRC

# Hash_CustomCrcAdd.Text
source: Add custom CRC...
ar: إضافة CRC مخصص...
cs: Přidat vlastní CRC...
de: Benutzerdefinierten CRC hinzufügen...
el: Προσθήκη προσαρμοσμένου CRC...
es: Agregar CRC personalizado...
fa: افزودن CRC سفارشی...
fr: Ajouter un CRC personnalisé...
hu: Egyéni CRC hozzáadása...
id: Tambah CRC kustom...
it: Aggiungi CRC personalizzato...
ja: カスタム CRC を追加...
ko: 사용자 지정 CRC 추가...
pl: Dodaj niestandardowy CRC...
pt: Adicionar CRC personalizado...
ro: Adăugare CRC personalizat...
th: เพิ่ม CRC ที่กำหนดเอง...
tr: Özel CRC ekle...
uk: Додати власний CRC...
vi: Thêm CRC tùy chỉnh...
zh_hans: 添加自定义 CRC...
zh_hant: 新增自訂 CRC...

# Hash_CustomCrcExport.Text
source: Export...
ar: تصدير...
cs: Exportovat...
de: Exportieren...
el: Εξαγωγή...
es: Exportar...
fa: صادر کردن...
fr: Exporter...
hu: Exportálás...
id: Ekspor...
it: Esporta...
ja: エクスポート...
ko: 내보내기...
pl: Eksportuj...
pt: Exportar...
ro: Exportare...
th: ส่งออก...
tr: Dışarı aktar...
uk: Експортувати...
vi: Xuất...
zh_hans: 导出...
zh_hant: 匯出...
